Repository: AlexDaniel-Projects/oppejoud.ee
Catalog: config/*.po
Languages: et, ru

source: Professor's name can't be blank.
et: Õppejõu nimi ei tohi olla tühi.
ru: Имя преподавателя не может быть пустым.

source: Please choose or enter a university.
et: Palun vali või sisesta ülikool.
ru: Выберите университет или введите название сами.

source: University name can't be longer than {count} symbols.
et: Aine nimi ei tohi olla pikem kui {count} sümbolit.
ru: Название предмета не может быть больше {count} символов.

source: Please enter a course name.
et: Palun sisesta õppeaine.
ru: Введите название курса.

source: Please enter a comment.
et: Palun sisesta kommentaar.
ru: Введите комментарий

source: Only letters, hyphens and spaces are allowed.
et: Lubatud on ainult tähed, sidekriips ja tühikud.
ru: Разрешены только буквы, дефис и пробелы.

source: Comment can't be longer than {count} symbols.
et: Kommentaar ei tohi olla pikem kui {count} sümbolit.
ru: Комментарий не может быть больше {count} символов.

source: Course name can't be longer than {count} symbols.
et: Aine nimi ei tohi olla pikem kui {count} sümbolit.
ru: Название предмета не может быть больше {count} символов.

source: Unacceptable radiobutton value.
et: Mittesobiv raadionupu väärtus.
ru: Непозволительное значение радиокнопки.

source: Or see the database
et: Või vaata andmebaasi
ru: Или смотрите базу данных

source: Want to know what others say about your professor?
et: Soovid teada, mis teised su tulevasest õppejõust räägivad?
ru: Хочешь знать, что другие говорят о твоем преподавателе?

source: Want to share your experience with other students?
et: Tahad oma kogemusi teiste tudengitega jagada?
ru: Хочешь поделиться своим опытом с другими?

source: You are in the right place!
et: Siis oled Sa õiges kohas.
ru: Ты попал в правильное место!

source: About the project
et: Projektist
ru: О проекте

source: We are all different, and our goals are different as well. Some decide to go the easy way, while others prefer challenges. Unfortunately, studying programmes are not perfect and do not account for students' special needs.
et: Kõik me oleme erinevad ja meie eesmärgid on ka erinevad. Mõni tahab minna kergemat teed, mõni raskemat. Kahjuks aga õppekavad ei ole alati perfektselt koostatud ning tudengite erisoovidega tihti ei arvestata.
ru: Все мы разные и цели у нас тоже разные. Некоторые хотят идти легким путем, другим же интереснее идти по сложному. К сожалению, учебные программы не идеальны и особенности студентов не учитываются.

source: There were times when I wished professors demanded more from me (when the course was interesting and useful), other times I wished the requirements were lower. Harsh reality is that courses that are not compulsory for my profession took most of the time, leaving absolutely required courses in the background.
et: Olen ise kokku puutunud situatsioonidega, kus tahaks, et õppejõud nõuaks rohkem (kui aine oli huvitav ja mulle vajalik) või vastupidi oleks tudengite suhtes leebem. Karm reaalsus aga on sundinud teinekord rohkem aega pühendama üldainetele, erialaained aga olid tagaplaanil.
ru: Я часто была в ситуации, когда мне хотелось, чтобы преподаватель требовал больше (если предмет был интересен и важен для меня). Или наоборот, когда хотелось, чтобы требования были менее строгими. В итоге получилось так, что на предметы, которые не связаны со специальностью, тратилось гораздо больше времени, чем они стоили. А необходимые для специальности предметы остались на заднем плане.

source: Today students in most universities are allowed not only to create their own schedules, but also to choose professors. This led me to a thought that it should be possible to “meet” your professor before you actually start attending the lectures.
et: Kuna tänapäeval saavad tudengid paljudes ülikoolides ise oma tunniplaani koostada ja õppejõude valida, tekkis mõte, et tudengitel peaks olema võimalus “tutvuda” õppejõududega enne seda kui nad loengusse tulevad.
ru: Сегодня во многих университетах есть возможность не только самим составлять свое расписание, но и выбирать преподавателя. Так и возникла идея, что у студентов должна быть возможность “познакомиться” со своим преподавателем, прежде чем начать ходить к нему на занятия.

source: Right now there are not enough feedbacks about Estonian professors on the Internet. I am hoping this project will improve the situation.
et: Hetkel on internetis äärmiselt vähe arvamusi eesti õppejõudude kohta. Loodan, et tänu sellele projektile olukord paraneb.
ru: В данным момент в интернете недостаточно информации об эстонских преподавателях. Надеюсь, что этот проект улучшит ситуацию.

source: The main goal of this project is not to rate professors according to some scale. There are no perfect or bad professors, you just have to find one that suits you.
et: Antud projekti eesmärk ei seisne selles, et õppejõude mingi skaala abil hinnata. Ei ole ideaalseid ega halbu õppejõude, tuleb vaid leida endale sobiv.
ru: Целью этого проекта не является оцениваение преподавателей. Не существует идеальных или плохих преподавателей, просто каждый должен выбрать подходящего для себя.

source: Recent comments:
et: Hiljutised kommentaarid:
ru: Последние комментарии:

source: Time added
et: Lisamise aeg
ru: Время добавления

source: Professor
et: Õppejõud
ru: Преподаватель

source: Comment
et: Kommentaar
ru: Комментарий

source: No comments have been added yet.
et: Kommentaare veel ei ole.
ru: Пока нет комментариев.

source: Contact
et: Kontakt
ru: Контакт

source: Your comments and suggestions are welcome.
et: Küsimused ja ettepanekud on oodatud.
ru: Буду рада твоим комментариям и предложениям.

source: FAQ
et: KKK

source: Students
et: Tudengid

source: My professor is missing
et: Minu õppejõud puudub nimekirjast

source: You can add a new name yourself. Just type the name into the search form and press ｢SEARCH｣. You will see a button that will lead you to a page where you will need to fill the required information (you only need first and last names).
et: Sina saad õppejõude ise lisada. Sisesta õppejõu nimi otsingu välja ja vajuta ｢OTSI｣. Siis näed nuppu, mis viib sind lehele, kus täidad vajalikku informatsiooni (on vaja sisestada vaid õppejõu ees- ja perekonnanime).

source: If you have a long list of names, I'd be happy if you contributed it (either in an automated way using the form mentioned above, or by simply
et: Kui sul on pikk õppejõudude nimekiri, võid selle lisada ülalpool mainitud vormi kaudu automaatselt (või lihtsalt

source: sending the list to me
et: saata mulle

source: Professors
et: Õppejõud
ru: Преподаватель

source: I do not want others to write things about me!
et: Ma ei taha, et keegi kirjutaks minust!

source: Why not? 😊
et: Miks mitte? 😊

source: Somebody will always be unhappy, but that's OK. Consider it as an opportunity to improve yourself, and as a result to have an even better impact on our next generation of specialists!
et: Keegi on alati õnnetu ja see on OK. Kaalutle seda nagu võimalust ennast paremaks teha!

source: My university already has a system for feedbacks, I like it more than your website
et: Minu ülikoolis on juba olemas süsteem, kus saab kommentaare jätta ja see meeldib mulle rohkem kui see portaal

source: Let's be honest here: how much do you care about feedbacks left in a non-public system of your university (do you even read them?), and how much do you care about things written on this website?
et: Ütle ausalt, kui palju sa hoolid suletud süsteemis jäetud kommentaaridest? Kas sa üldse loed neid? Ja palju sa hoolid sellest, mis on sellel veebilehel kirjutatud?

source: If your university was publishing all of the feedbacks, your name wouldn't be on this website.
et: Kui sinu ülikool oleks kõiki kommentaare avalikeks teinud, seda veebilehte ei eksisteeriks.

source: Someone wrote lies about me!
et: Keegi kirjutas laimu minu kohta!

source: Feel free to leave a comment yourself to explain the situation. There have been cases like this.
et: Jäta ise kommentaar ja seleta olukord lahti. Selliseid olukordi on juhtunud.

source: Please enter at least {count} symbols.
et: Palun sisesta vähemalt {count} sümbolit.
ru: Пожалуйста введите хотя бы {count} символа.

source: Query can't be longer than {count} symbols.
et: Päring ei tohi olla pikem kui {count} sümbolit.
ru: Запрос не может быть длиннее {count} символов.

source: Search results ({name}):
et: Otsingu tulemused ({name}):
ru: Результаты поиска ({name}):

source: Sorry, nothing was found.
et: Sisestatud otsingusõnale ei leitud ühtegi vastet.
ru: К сожалению, ничего не было найдено.

source: Error
et: Viga
ru: Ошибка

source: Nothing was found for your query ({name}).
et: Sisestatud otsingusõnale ({name}) ei leitud ühtegi vastet.
ru: К сожалению, по Вашему запросу ({name}) ничего не было найдено.

source: Please fill both fields.
et: Palun täida mõlemad väljad.
ru: Пожалуйста заполните оба поля.

source: This professor already exists in the database.
et: Õppejõud on andmebaasis olemas.
ru: Этот преподаватель уже существует в базе данных.

source: View page
et: Vaata
ru: Смотреть страницу

source: All professors ({count}):
et: Kõik õppejõud ({count}):
ru: Все преподаватели ({count}):

source: Recent comments
et: Hiljutised kommentaarid
ru: Последние комментарии

source: Find a perfectly suitable professor!
et: Leia just Sulle sobiv õppejõud!
ru: Найди преподавателя, подходящего именно тебе!

source: Enter professor's name:
et: Sisesta õppejõu nimi:
ru: Введите имя преподавателя:

source: SEARCH
et: OTSI
ru: ИСКАТЬ

source: Couldn't find yours? Enter it manually.
et: Ülikool puudub nimekirjas? Sisesta ise:
ru: Не можешь найти свой? Впиши его сам.

source: Add a new professor
et: Lisa õppejõud
ru: Добавь преподавателя

source: Professor's name
et: Õppejõu eesnimi
ru: Имя преподавателя

source: Professor's lastname
et: Õppejõu perekonnanimi
ru: Фамилия преподавателя

source: ADD
et: LISA
ru: ДОБАВИТЬ

source: Professor: {name}
et: Õppejõud: {name}
ru: Преподаватель: {name}

source: Add a comment
et: Lisa kommentaar
ru: Добавить комментарий

source: Comments:
et: Kommentaarid:
ru: Комментарии:

source: Comments were not added yet.
et: Kommentaare veel ei ole.
ru: Пока нет комментариев.

source: University:
et: Ülikool:
ru: Университет:

source: Course:
et: Õppeaine:
ru: Предмет:

source: This comment was tagged as “suspicious”. Possible reasons are: someone writing multiple angry comments at once; a professor writing comments about themselves, etc.
et: Kommentaar on märgitud kahtlaseks. Võimalikud põhjused: kirjutatakse mitu kurja kommentaari järjest; õppejoud kirjutab iseendast; jne.

source: This comment was tagged as a response by the professor.
et: Kommentaar on märgitud kui vastus õppejõu poolt.

source: Add your comment:
et: Lisa oma kommentaar
ru: Добавь свой комментарий:

source: Course name:
et: Õppeaine:
ru: Название предмета:

source: Comment:
et: Kommentaar:
ru: Комментарий:

source: General impression:
et: Üldine mulje:
ru: Обшее впечатление:

source: bad
et: halb
ru: плохо

source: neutral
et: neutraalne
ru: нейтрально

source: good
et: hea
ru: хорошо

source: SEND
et: SAADA
ru: ОТПРАВИТЬ

source: Add a new professor!
et: Lisa õppejõud!
ru: Добавь преподавателя!

source: But I am not a professor!
ru: Добавь преподавателя!
